In [2]:
#3 Importing Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
path = r'C:\Users\Riley\Desktop\Data Any\DD-MM-2022-Instacart Basket Analysis'

In [4]:
# Import Customer Data
df = pd.read_csv(os.path.join(path, '02 Data', '4.3_orders_products', 'customers.csv'))

In [5]:
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
df.shape

(206209, 10)

In [7]:
df.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [8]:
#4 Renaming Columns
df = df.rename(columns = {'First Name':'first_name', 'Surnam':'surname', 'Gender':'gender', 'STATE':'state', 'Age':'age'})

In [9]:
df.dtypes

user_id          int64
first_name      object
surname         object
gender          object
state           object
age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [10]:
#5 Check for Missing Values
df.isnull().sum()

user_id             0
first_name      11259
surname             0
gender              0
state               0
age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

The first name column could be useful later so I will leave it as is.

In [11]:
# Duplicate Check
df_dup = df[df.duplicated()]
df_dup

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

No duplicates shown

In [12]:
# Mixed Data check
for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

first_name

In [13]:
# first name converted to string
df['first_name'] = df['first_name'].astype('str')

In [14]:
for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

No mixed data anymore

In [15]:
#6 Importing Prepared Data
df_prod = pd.read_pickle(os.path.join(path, '02 Data', '4.3_orders_products', '4.8_ords_prods_merge.pkl'))

In [16]:
df_prod.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,aisle_id,department_id,prices,_merge,max_order,loyalty_flag,spending,spending_flag,frequency,frequency_flag
0,2539329,1,prior,1,2,8,NaN,196.0,1.0,0.0,...,77.0,7.0,9.0,both,11,Regular customer,6.367797,Low Spender,20.0,Regular customer
1,2539329,1,prior,1,2,8,NaN,14084.0,2.0,0.0,...,91.0,16.0,12.5,both,11,Regular customer,6.367797,Low Spender,20.0,Regular customer
2,2539329,1,prior,1,2,8,NaN,12427.0,3.0,0.0,...,23.0,19.0,4.4,both,11,Regular customer,6.367797,Low Spender,20.0,Regular customer
3,2539329,1,prior,1,2,8,NaN,26088.0,4.0,0.0,...,23.0,19.0,4.7,both,11,Regular customer,6.367797,Low Spender,20.0,Regular customer
4,2539329,1,prior,1,2,8,NaN,26405.0,5.0,0.0,...,54.0,17.0,1.0,both,11,Regular customer,6.367797,Low Spender,20.0,Regular customer

In [17]:
# Memory Size Info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   first_name    206209 non-null  object
 2   surname       206209 non-null  object
 3   gender        206209 non-null  object
 4   state         206209 non-null  object
 5   age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [18]:
df_prod.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32641268 entries, 0 to 32641267
Data columns (total 21 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   eval_set                object
 3   order_number            int64
 4   orders_day_of_week      int64
 5   order_hour_of_day       int64
 6   days_since_prior_order  float64
 7   product_id              float32
 8   add_to_cart_order       float32
 9   reordered               float32
 10  product_name            object
 11  aisle_id                float64
 12  department_id           float64
 13  prices                  float64
 14  _merge                  category
 15  max_order               int64
 16  loyalty_flag            object
 17  spending                float64
 18  spending_flag           object
 19  frequency               float64
 20  frequency_flag          object
dtypes: category(1), float32(3), float64(6), int64(6), object(5)
memory usage: 4.8+ GB

In [19]:
# Memory Reduction steps
df_prod['order_id'] = df_prod['order_id'].astype('int16')

In [20]:
df_prod['add_to_cart_order'] = df_prod['add_to_cart_order'].apply('int16')

In [21]:
df_prod['aisle_id'] = df_prod['aisle_id'].apply('int16')

In [22]:
df_prod['max_order'] = df_prod['max_order'].apply('int16')

In [23]:
df_prod['department_id'] = df_prod['department_id'].apply('int16')

In [24]:
df_prod['spending'] = df_prod['spending'].apply('float32')

In [25]:
df_prod['frequency'] = df_prod['frequency'].apply('float32')

In [26]:
df_prod['prices'] = df_prod['prices'].apply('float32')

In [29]:
df_prod['order_number'] = df_prod['order_number'].apply('int16')

In [30]:
df_prod['orders_day_of_week'] = df_prod['orders_day_of_week'].apply('int16')

In [31]:
df_prod['order_hour_of_day'] = df_prod['order_hour_of_day'].apply('int16')

In [32]:
df_prod.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32641268 entries, 0 to 32641267
Data columns (total 21 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int16
 1   user_id                 int64
 2   eval_set                object
 3   order_number            int16
 4   orders_day_of_week      int16
 5   order_hour_of_day       int16
 6   days_since_prior_order  float64
 7   product_id              float32
 8   add_to_cart_order       int16
 9   reordered               float32
 10  product_name            object
 11  aisle_id                int16
 12  department_id           int16
 13  prices                  float32
 14  _merge                  category
 15  max_order               int16
 16  loyalty_flag            object
 17  spending                float32
 18  spending_flag           object
 19  frequency               float32
 20  frequency_flag          object
dtypes: category(1), float32(5), float64(1), int16(8), int64(1), object(5)
memory usage: 3.1+ GB

In [33]:
df_merge = df_prod.merge(df, on = 'user_id', indicator = 'exists')

In [34]:
df_merge.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,first_name,surname,gender,state,age,date_joined,n_dependants,fam_status,income,exists
0,-16575,1,prior,1,2,8,NaN,196.0,1,0.0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,-16575,1,prior,1,2,8,NaN,14084.0,2,0.0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,-16575,1,prior,1,2,8,NaN,12427.0,3,0.0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,-16575,1,prior,1,2,8,NaN,26088.0,4,0.0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,-16575,1,prior,1,2,8,NaN,26405.0,5,0.0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [35]:
df_merge['_merge'].value_counts(dropna = False)

both          32404859
left_only       236409
right_only           0
Name: _merge, dtype: int64

In [36]:
#8 Export
df_merge.to_pickle(os.path.join(path, '02 Data', '4.3_orders_products', 'ords_prods_cust(4.9).pkl'))